//Даны два числа. Показать большее и меньшее число
int a = 50;
int b = 100;

if (a > b)
{
    Console.WriteLine("Max = " + a);
    Console.WriteLine("Min = " + b);

}
else
{
    Console.WriteLine("Max = " + b);
    Console.WriteLine("Min = " + a);
}